import GUI

'''
추가되어야할 사항들: 

1. - 해결
- 값입력 안할때 - 해결
- 숫자가 아닌값 입력했을때 - 해결
- 이미지 경로가 없을때 - 해결
- 이미지 경로에 파일이 없을 때 - 해결
- 이미지형식이 아닐때 - 해결
=> 경고창 띄우기 - 해결

2. 
값 입력되면 창 크기 늘리고 저장되었습니다 뜨게하기  -> 해결

3. 
일정시간 지나면 창 크기 복원 및 글씨 삭제 -> 해결
이미 쓰레드 타이머가 활성화된 상태에서 엔터를 연타하면 쓰레드 수 늘어나면서 의도치않은 버그가 생기는 문제 -> 해결
버튼 눌린 형태로 존재하는 버그 해결 -> 해결
높이 넓이 동시에 입력하면 생기는 버그 해결 -> 해결

4. 
이미지 창 띄우고 원본 이미지와 변경 후 이미지 보여주기 -> 보류 (다음 버전에 업데이트 예정)

5. 
이미지 크기 확대할때와 축소할때 구분하기, 해당 이미지 파일 가져와서 축소인지 확대인지 구분 -> 해결
이미지 크기 조절할때 화질 손실없이 조절하기 -> 해결

'''


GUI.window.mainloop()
